src/cf/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ДолжностнаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДолжностныеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ОтписалсяОтEmailРассылок</Name>
					<Comment>Отписался от Email рассылок</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Планируемый</Name>
					<Comment>Участвует в планировании проектов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УчаствуетВАнкетировании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УровеньДоступа</Name>
					<Comment>Не переносить в объединенные решения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_УровниДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Фотография</Name>
					<Comment>Фотография клиента частное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>вогРуководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_ДополнительнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CRM_ДополнительнаяИнформация</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогПодразделенияДляПорученийДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>вогПользователиДляПорученияДоп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/вогИерархияСтруктурыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогИерархияСтруктурыПредприятия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/Пользователи/Forms/вогФормаВыбора/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьОтборПоДоступнымПользователям(Подразделение = Неопределено)
	
	СДополнительными = Ложь;
	
	Если Параметры.Свойство("СДополнительными") Тогда
		СДополнительными = Параметры.СДополнительными;
	КонецЕсли;
	
	ОбластьДелегированияПрав = "";
	
	Если Параметры.Свойство("ОбластьДелегированияПрав") Тогда
		ОбластьДелегированияПрав = Параметры.ОбластьДелегированияПрав;	
	КонецЕсли;	
	
	СписокДоступныхПользователей = CRM_УправлениеДоступомКПользователям.ПолучитьСписокДоступныхПользователей();
	
	ОтчетыКлиентСервер.ДополнитьСписок(СписокДоступныхПользователей, вогНастраиваемоеДелегированиеПрав.ПолучитьСписокПодчиненныхСотрудниковДелегата(ПараметрыСеанса.ТекущийПользователь, ОбластьДелегированияПрав)); //Павелко, CRM-69, 18.12.2019
	
	Если СДополнительными Тогда
		ТекущийПользователь = Пользователи.ТекущийПользователь();
		Для каждого Стр из ТекущийПользователь.вогПользователиДляПорученияДоп цикл	
			СписокДоступныхПользователей.Добавить(Стр.Пользователь);	
		КонецЦикла;
	КонецЕсли;
	
	РуководительПользователя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователи.ТекущийПользователь(), "вогРуководитель");
	Если ЗначениеЗаполнено(РуководительПользователя) Тогда
		СписокДоступныхПользователей.Добавить(РуководительПользователя);
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПользователиСписок, "Ссылка", СписокДоступныхПользователей, ВидСравненияКомпоновкиДанных.ВСписке);
	
	Если Подразделение <> Неопределено тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПользователиСписок, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно);	
	Иначе
		CRM_ОбщегоНазначенияКлиентСервер.УдалитьЭлементОтбораСписка(ПользователиСписок, "Подразделение");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоДоступнымПользователям();
	
	ПодразделенияДеревоСервер = РеквизитФормыВЗначение("ПодразделенияДерево");
	
	Если Параметры.Свойство("РуководительПользователя") И ЗначениеЗаполнено(Параметры.РуководительПользователя) Тогда
		ЗаполнитьДеревоПодразделенийПоДаннымПользователя(
			ЭтотОбъект,
			ПодразделенияДеревоСервер,
			Параметры.РуководительПользователя);
	Иначе
		ЗаполнитьДеревоПодразделенийПоДаннымПользователя(ЭтотОбъект, ПодразделенияДеревоСервер);
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ПодразделенияДеревоСервер, "ПодразделенияДерево");
	
КонецПроцедуры

Процедура ЗаполнитьДеревоПодразделенийПоДаннымПользователя(Форма, ДеревоПодразделений, Знач Пользователь = Неопределено) Экспорт

	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();	
	
	КонецЕсли;	
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Подразделение");	
	СтруктураРеквизитов.Вставить("CRM_ДолжностнаяПозиция");
	// ++ VOG Солодов В.В. 05.08.2019 task 464
	СтруктураРеквизитов.Вставить("вогРуководитель");
	// -- VOG Солодов В.В. 05.08.2019
	
	РеквизитыПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Пользователь, СтруктураРеквизитов);
	
	ДеревоПодразделений.Строки.Очистить();
	
	//Подчиненные 
	СтрокаУзда 				  = ДеревоПодразделений.Строки.Добавить();
	СтрокаУзда.Ссылка 		  = РеквизитыПользователя.Подразделение;          
	СтрокаУзда.Представление  = НСтр("ru = 'Подчиненные'");
	СтрокаУзда.ИндексКартинки = 6;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("Предопределенный");	
	СтруктураРеквизитов.Вставить("ПометкаУдаления");	
	
	РеквизитыПодразделения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(РеквизитыПользователя.Подразделение, СтруктураРеквизитов);
	Если РеквизитыПодразделения.Предопределенный = Истина Тогда
		ИндексКартинки = 5;	
	ИначеЕсли РеквизитыПодразделения.ПометкаУдаления = Истина Тогда
		ИндексКартинки = 4;	
	Иначе
		ИндексКартинки = 3;	
	КонецЕсли;
	
	ЗаполнитьСтрокиДереваПодразделенийРекурсивно(СтрокаУзда.Строки, РеквизитыПользователя.Подразделение, ИндексКартинки);
	
	// ++ VOG Солодов В.В. 05.08.2019 task 464
	// По руководителю пользователя
	Если ЗначениеЗаполнено(РеквизитыПользователя.вогРуководитель) Тогда
		
		ПодразделениеРуководителя 
			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыПользователя.вогРуководитель, "Подразделение");
		
		Если ЗначениеЗаполнено(ПодразделениеРуководителя)
			И ПодразделениеРуководителя <> РеквизитыПользователя.Подразделение Тогда
			
			СтрокаУзда 					= ДеревоПодразделений.Строки.Добавить();
			СтрокаУзда.Ссылка 			= ПодразделениеРуководителя;
			СтрокаУзда.Представление 	= НСтр("ru = 'Руководитель'");
			СтрокаУзда.ИндексКартинки 	= 0;
			
			НоваяСтрока 				= СтрокаУзда.Строки.Добавить();
			НоваяСтрока.Ссылка 			= ПодразделениеРуководителя;
			НоваяСтрока.Представление 	= ПодразделениеРуководителя;
			НоваяСтрока.ИндексКартинки 	= 3;
			
		КонецЕсли;
		
	КонецЕсли;
	// -- VOG Солодов В.В. 05.08.2019
	
	//Того же уровня
	Если Не ЗначениеЗаполнено(РеквизитыПользователя.Подразделение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Подразделение", РеквизитыПользователя.Подразделение);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИерархияСтруктурыПредприятия.Уровень КАК Уровень
		|ПОМЕСТИТЬ ТекущийУровень
		|ИЗ
		|	РегистрСведений.вогИерархияСтруктурыПредприятия КАК ИерархияСтруктурыПредприятия
		|ГДЕ
		|	ИерархияСтруктурыПредприятия.Родитель = &Подразделение
		|	И ИерархияСтруктурыПредприятия.Подразделение = ИерархияСтруктурыПредприятия.Родитель
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Уровень
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИерархияСтруктурыПредприятия.Подразделение,
		|	ВЫБОР
		|		КОГДА ИерархияСтруктурыПредприятия.Подразделение.Предопределенный
		|			ТОГДА 5
		|		КОГДА ИерархияСтруктурыПредприятия.Подразделение.ПометкаУдаления
		|			ТОГДА 4
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ИндексКартинки
		|ИЗ
		|	РегистрСведений.вогИерархияСтруктурыПредприятия КАК ИерархияСтруктурыПредприятия
		|ГДЕ
		|	ИерархияСтруктурыПредприятия.Подразделение <> &Подразделение
		|	И ИерархияСтруктурыПредприятия.Уровень В
		|			(ВЫБРАТЬ
		|				ТекущийУровень.Уровень
		|			ИЗ
		|				ТекущийУровень КАК ТекущийУровень)
		|	И ИерархияСтруктурыПредприятия.Подразделение = ИерархияСтруктурыПредприятия.Родитель";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		СтрокаУзда 				  = ДеревоПодразделений.Строки.Добавить();
		СтрокаУзда.Ссылка 		  = РеквизитыПользователя.Подразделение;
		СтрокаУзда.Представление  = НСтр("ru = 'По уровню подразделения'");
		СтрокаУзда.ИндексКартинки = 7;
	
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьСтрокиДереваПодразделенийРекурсивно(СтрокаУзда.Строки, Выборка.Подразделение, Выборка.ИндексКартинки);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиДереваПодразделенийРекурсивно(Строки, Подразделение, ИндексКартинки)
		
	НоваяСтрока		  		   = Строки.Добавить();	
	НоваяСтрока.Ссылка 		   = Подразделение;
	НоваяСтрока.Представление  = Подразделение;
	НоваяСтрока.ИндексКартинки = ИндексКартинки;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СтруктураПредприятия.Ссылка КАК Ссылка,
		|	ВЫБОР
		|		КОГДА СтруктураПредприятия.Предопределенный
		|			ТОГДА 5
		|		КОГДА СтруктураПредприятия.ПометкаУдаления
		|			ТОГДА 4
		|		ИНАЧЕ 3
		|	КОНЕЦ КАК ИндексКартинки
		|ИЗ
		|	Справочник.СтруктураПредприятия КАК СтруктураПредприятия
		|ГДЕ
		|	СтруктураПредприятия.Родитель = &ТекущийРодитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("ТекущийРодитель", Подразделение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьСтрокиДереваПодразделенийРекурсивно(НоваяСтрока.Строки, Выборка.Ссылка, Выборка.ИндексКартинки);	
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияДеревоПриАктивизацииСтроки(Элемент)
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииГруппы()
	
	Если Элементы.ПодразделенияДерево.ТекущиеДанные.Представление = "Подчиненные" тогда
		УстановитьОтборПоДоступнымПользователям();
	Иначе	
		УстановитьОтборПоДоступнымПользователям(Элементы.ПодразделенияДерево.ТекущиеДанные.Ссылка);
	КонецЕсли;	
	
КонецПроцедуры
